# FaceWallFailedToMake Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FaceWallFailedToMake Property
BuiltInFailures..::..WallFailures Class See Also
---
Can't make Face Wall shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceWallFailedToMake { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceWallFailedToMake As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceWallFailedToMake {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace